MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1778/mcu.h
extern volatile CM2PSELbits_t CM2PSELbits __at(0x119);
// bitfield macros
#define _CM2PSEL_PCH_POSN                                   0x0
#define _CM2PSEL_PCH_POSITION                               0x0
#define _CM2PSEL_PCH_SIZE                                   0x4
#define _CM2PSEL_PCH_LENGTH                                 0x4
#define _CM2PSEL_PCH_MASK                                   0xF
#define _CM2PSEL_PCH0_POSN                                  0x0
#define _CM2PSEL_PCH0_POSITION                              0x0
#define _CM2PSEL_PCH0_SIZE                                  0x1
#define _CM2PSEL_PCH0_LENGTH                                0x1
#define _CM2PSEL_PCH0_MASK                                  0x1
#define _CM2PSEL_PCH1_POSN                                  0x1
#define _CM2PSEL_PCH1_POSITION                              0x1
#define _CM2PSEL_PCH1_SIZE                                  0x1
#define _CM2PSEL_PCH1_LENGTH                                0x1
#define _CM2PSEL_PCH1_MASK                                  0x2
#define _CM2PSEL_PCH2_POSN                                  0x2
#define _CM2PSEL_PCH2_POSITION                              0x2
#define _CM2PSEL_PCH2_SIZE                                  0x1
#define _CM2PSEL_PCH2_LENGTH                                0x1
#define _CM2PSEL_PCH2_MASK                                  0x4
#define _CM2PSEL_PCH3_POSN                                  0x3
#define _CM2PSEL_PCH3_POSITION                              0x3
#define _CM2PSEL_PCH3_SIZE                                  0x1
#define _CM2PSEL_PCH3_LENGTH                                0x1
#define _CM2PSEL_PCH3_MASK                                  0x8
#define _CM2PSEL_C2PCH_POSN                                 0x0
#define _CM2PSEL_C2PCH_POSITION                             0x0
#define _CM2PSEL_C2PCH_SIZE                                 0x4
#define _CM2PSEL_C2PCH_LENGTH                               0x4
#define _CM2PSEL_C2PCH_MASK                                 0xF
#define _CM2PSEL_C2PCH0_POSN                                0x0
#define _CM2PSEL_C2PCH0_POSITION                            0x0
#define _CM2PSEL_C2PCH0_SIZE                                0x1
#define _CM2PSEL_C2PCH0_LENGTH                              0x1
#define _CM2PSEL_C2PCH0_MASK                                0x1
#define _CM2PSEL_C2PCH1_POSN                                0x1
#define _CM2PSEL_C2PCH1_POSITION                            0x1
#define _CM2PSEL_C2PCH1_SIZE                                0x1
#define _CM2PSEL_C2PCH1_LENGTH                              0x1
#define _CM2PSEL_C2PCH1_MASK                                0x2
#define _CM2PSEL_C2PCH2_POSN                                0x2
#define _CM2PSEL_C2PCH2_POSITION                            0x2
#define _CM2PSEL_C2PCH2_SIZE                                0x1
#define _CM2PSEL_C2PCH2_LENGTH                              0x1
#define _CM2PSEL_C2PCH2_MASK                                0x4
#define _CM2PSEL_C2PCH3_POSN                                0x3
#define _CM2PSEL_C2PCH3_POSITION                            0x3
#define _CM2PSEL_C2PCH3_SIZE                                0x1
#define _CM2PSEL_C2PCH3_LENGTH                              0x1
#define _CM2PSEL_C2PCH3_MASK                                0x8

// Register: CM3CON0
#define CM3CON0 CM3CON0
extern volatile unsigned char           CM3CON0             __at(0x11A);
#ifndef _LIB_BUILD
asm("CM3CON0 equ 011Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C3SYNC                 :1;
        unsigned C3HYS                  :1;
        unsigned                        :1;
        unsigned C3ZLF                  :1;
        unsigned C3POL                  :1;
        unsigned                        :1;
        unsigned C3OUT                  :1;
        unsigned C3ON                   :1;
    };
} CM3CON0bits_t;
extern volatile CM3CON0bits_t CM3CON0bits __at(0x11A);
// bitfield macros
#define _CM3CON0_SYNC_POSN                                  0x0
#define _CM3CON0_SYNC_POSITION                              0x0
#define _CM3CON0_SYNC_SIZE                                  0x1
#define _CM3CON0_SYNC_LENGTH                                0x1
#define _CM3CON0_SYNC_MASK                                  0x1
#define _CM3CON0_HYS_POSN                                   0x1
#define _CM3CON0_HYS_POSITION                               0x1
#define _CM3CON0_HYS_SIZE                                   0x1
#define _CM3CON0_HYS_LENGTH                                 0x1
#define _CM3CON0_HYS_MASK                                   0x2
#define _CM3CON0_ZLF_POSN                                   0x3
#define _CM3CON0_ZLF_POSITION                               0x3
#define _CM3CON0_ZLF_SIZE                                   0x1
#define _CM3CON0_ZLF_LENGTH                                 0x1
#define _CM3CON0_ZLF_MASK                                   0x8
#define _CM3CON0_POL_POSN                                   0x4
#define _CM3CON0_POL_POSITION                               0x4
#define _CM3CON0_POL_SIZE                                   0x1
#define _CM3CON0_POL_LENGTH                                 0x1
#define _CM3CON0_POL_MASK                                   0x10
#define _CM3CON0_OUT_POSN                                   0x6
#define _CM3CON0_OUT_POSITION                               0x6
#define _CM3CON0_OUT_SIZE                                   0x1
#define _CM3CON0_OUT_LENGTH                                 0x1
#define _CM3CON0_OUT_MASK                                   0x40
#define _CM3CON0_ON_POSN                                    0x7
#define _CM3CON0_ON_POSITION                                0x7
#define _CM3CON0_ON_SIZE                                    0x1
#define _CM3CON0_ON_LENGTH                                  0x1
#define _CM3CON0_ON_MASK                                    0x80
#define _CM3CON0_C3SYNC_POSN                                0x0
#define _CM3CON0_C3SYNC_POSITION                            0x0
#define _CM3CON0_C3SYNC_SIZE                                0x1
#define _CM3CON0_C3SYNC_LENGTH                              0x1
#define _CM3CON0_C3SYNC_MASK                                0x1
#define _CM3CON0_C3HYS_POSN                                 0x1
#define _CM3CON0_C3HYS_POSITION                             0x1
#define _CM3CON0_C3HYS_SIZE                                 0x1
#define _CM3CON0_C3HYS_LENGTH                               0x1
#define _CM3CON0_C3HYS_MASK                                 0x2
#define _CM3CON0_C3ZLF_POSN                                 0x3
#define _CM3CON0_C3ZLF_POSITION                             0x3
#define _CM3CON0_C3ZLF_SIZE                                 0x1
#define _CM3CON0_C3ZLF_LENGTH                               0x1
#define _CM3CON0_C3ZLF_MASK                                 0x8
#define _CM3CON0_C3POL_POSN                                 0x4
#define _CM3CON0_C3POL_POSITION                             0x4
#define _CM3CON0_C3POL_SIZE                                 0x1
#define _CM3CON0_C3POL_LENGTH                               0x1
#define _CM3CON0_C3POL_MASK                                 0x10
#define _CM3CON0_C3OUT_POSN                                 0x6
#define _CM3CON0_C3OUT_POSITION                             0x6
#define _CM3CON0_C3OUT_SIZE                                 0x1
#define _CM3CON0_C3OUT_LENGTH                               0x1
#define _CM3CON0_C3OUT_MASK                                 0x40
#define _CM3CON0_C3ON_POSN                                  0x7
#define _CM3CON0_C3ON_POSITION                              0x7
#define _CM3CON0_C3ON_SIZE                                  0x1
#define _CM3CON0_C3ON_LENGTH                                0x1
#define _CM3CON0_C3ON_MASK                                  0x80

// Register: CM3CON1
#define CM3CON1 CM3CON1
extern volatile unsigned char           CM3CON1             __at(0x11B);
#ifndef _LIB_BUILD
asm("CM3CON1 equ 011Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C3INTN                 :1;
        unsigned C3INTP                 :1;
    };
} CM3CON1bits_t;
