MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1778/mcu.h
extern volatile DAC5REFHbits_t DAC5REFHbits __at(0x59A);
// bitfield macros
#define _DAC5REFH_REF_POSN                                  0x0
#define _DAC5REFH_REF_POSITION                              0x0
#define _DAC5REFH_REF_SIZE                                  0x8
#define _DAC5REFH_REF_LENGTH                                0x8
#define _DAC5REFH_REF_MASK                                  0xFF
#define _DAC5REFH_DAC5REF8_POSN                             0x0
#define _DAC5REFH_DAC5REF8_POSITION                         0x0
#define _DAC5REFH_DAC5REF8_SIZE                             0x1
#define _DAC5REFH_DAC5REF8_LENGTH                           0x1
#define _DAC5REFH_DAC5REF8_MASK                             0x1
#define _DAC5REFH_DAC5REF9_POSN                             0x1
#define _DAC5REFH_DAC5REF9_POSITION                         0x1
#define _DAC5REFH_DAC5REF9_SIZE                             0x1
#define _DAC5REFH_DAC5REF9_LENGTH                           0x1
#define _DAC5REFH_DAC5REF9_MASK                             0x2
#define _DAC5REFH_DAC5REF10_POSN                            0x2
#define _DAC5REFH_DAC5REF10_POSITION                        0x2
#define _DAC5REFH_DAC5REF10_SIZE                            0x1
#define _DAC5REFH_DAC5REF10_LENGTH                          0x1
#define _DAC5REFH_DAC5REF10_MASK                            0x4
#define _DAC5REFH_DAC5REF11_POSN                            0x3
#define _DAC5REFH_DAC5REF11_POSITION                        0x3
#define _DAC5REFH_DAC5REF11_SIZE                            0x1
#define _DAC5REFH_DAC5REF11_LENGTH                          0x1
#define _DAC5REFH_DAC5REF11_MASK                            0x8
#define _DAC5REFH_DAC5REF12_POSN                            0x4
#define _DAC5REFH_DAC5REF12_POSITION                        0x4
#define _DAC5REFH_DAC5REF12_SIZE                            0x1
#define _DAC5REFH_DAC5REF12_LENGTH                          0x1
#define _DAC5REFH_DAC5REF12_MASK                            0x10
#define _DAC5REFH_DAC5REF13_POSN                            0x5
#define _DAC5REFH_DAC5REF13_POSITION                        0x5
#define _DAC5REFH_DAC5REF13_SIZE                            0x1
#define _DAC5REFH_DAC5REF13_LENGTH                          0x1
#define _DAC5REFH_DAC5REF13_MASK                            0x20
#define _DAC5REFH_DAC5REF14_POSN                            0x6
#define _DAC5REFH_DAC5REF14_POSITION                        0x6
#define _DAC5REFH_DAC5REF14_SIZE                            0x1
#define _DAC5REFH_DAC5REF14_LENGTH                          0x1
#define _DAC5REFH_DAC5REF14_MASK                            0x40
#define _DAC5REFH_DAC5REF15_POSN                            0x7
#define _DAC5REFH_DAC5REF15_POSITION                        0x7
#define _DAC5REFH_DAC5REF15_SIZE                            0x1
#define _DAC5REFH_DAC5REF15_LENGTH                          0x1
#define _DAC5REFH_DAC5REF15_MASK                            0x80
#define _DAC5REFH_R8_POSN                                   0x0
#define _DAC5REFH_R8_POSITION                               0x0
#define _DAC5REFH_R8_SIZE                                   0x1
#define _DAC5REFH_R8_LENGTH                                 0x1
#define _DAC5REFH_R8_MASK                                   0x1
#define _DAC5REFH_R9_POSN                                   0x1
#define _DAC5REFH_R9_POSITION                               0x1
#define _DAC5REFH_R9_SIZE                                   0x1
#define _DAC5REFH_R9_LENGTH                                 0x1
#define _DAC5REFH_R9_MASK                                   0x2
#define _DAC5REFH_R10_POSN                                  0x2
#define _DAC5REFH_R10_POSITION                              0x2
#define _DAC5REFH_R10_SIZE                                  0x1
#define _DAC5REFH_R10_LENGTH                                0x1
#define _DAC5REFH_R10_MASK                                  0x4
#define _DAC5REFH_R11_POSN                                  0x3
#define _DAC5REFH_R11_POSITION                              0x3
#define _DAC5REFH_R11_SIZE                                  0x1
#define _DAC5REFH_R11_LENGTH                                0x1
#define _DAC5REFH_R11_MASK                                  0x8
#define _DAC5REFH_R12_POSN                                  0x4
#define _DAC5REFH_R12_POSITION                              0x4
#define _DAC5REFH_R12_SIZE                                  0x1
#define _DAC5REFH_R12_LENGTH                                0x1
#define _DAC5REFH_R12_MASK                                  0x10
#define _DAC5REFH_R13_POSN                                  0x5
#define _DAC5REFH_R13_POSITION                              0x5
#define _DAC5REFH_R13_SIZE                                  0x1
#define _DAC5REFH_R13_LENGTH                                0x1
#define _DAC5REFH_R13_MASK                                  0x20
#define _DAC5REFH_R14_POSN                                  0x6
#define _DAC5REFH_R14_POSITION                              0x6
#define _DAC5REFH_R14_SIZE                                  0x1
#define _DAC5REFH_R14_LENGTH                                0x1
#define _DAC5REFH_R14_MASK                                  0x40
#define _DAC5REFH_R15_POSN                                  0x7
#define _DAC5REFH_R15_POSITION                              0x7
#define _DAC5REFH_R15_SIZE                                  0x1
#define _DAC5REFH_R15_LENGTH                                0x1
#define _DAC5REFH_R15_MASK                                  0x80
#define _DAC5REFH_DAC5R8_POSN                               0x0
#define _DAC5REFH_DAC5R8_POSITION                           0x0
#define _DAC5REFH_DAC5R8_SIZE                               0x1
#define _DAC5REFH_DAC5R8_LENGTH                             0x1
#define _DAC5REFH_DAC5R8_MASK                               0x1
#define _DAC5REFH_DAC5R9_POSN                               0x1
#define _DAC5REFH_DAC5R9_POSITION                           0x1
#define _DAC5REFH_DAC5R9_SIZE                               0x1
#define _DAC5REFH_DAC5R9_LENGTH                             0x1
#define _DAC5REFH_DAC5R9_MASK                               0x2
#define _DAC5REFH_DAC5R10_POSN                              0x2
#define _DAC5REFH_DAC5R10_POSITION                          0x2
#define _DAC5REFH_DAC5R10_SIZE                              0x1
#define _DAC5REFH_DAC5R10_LENGTH                            0x1
#define _DAC5REFH_DAC5R10_MASK                              0x4
#define _DAC5REFH_DAC5R11_POSN                              0x3
#define _DAC5REFH_DAC5R11_POSITION                          0x3
#define _DAC5REFH_DAC5R11_SIZE                              0x1
#define _DAC5REFH_DAC5R11_LENGTH                            0x1
#define _DAC5REFH_DAC5R11_MASK                              0x8
#define _DAC5REFH_DAC5R12_POSN                              0x4
#define _DAC5REFH_DAC5R12_POSITION                          0x4
#define _DAC5REFH_DAC5R12_SIZE                              0x1
#define _DAC5REFH_DAC5R12_LENGTH                            0x1
#define _DAC5REFH_DAC5R12_MASK                              0x10
#define _DAC5REFH_DAC5R13_POSN                              0x5
#define _DAC5REFH_DAC5R13_POSITION                          0x5
#define _DAC5REFH_DAC5R13_SIZE                              0x1
#define _DAC5REFH_DAC5R13_LENGTH                            0x1
#define _DAC5REFH_DAC5R13_MASK                              0x20
#define _DAC5REFH_DAC5R14_POSN                              0x6
#define _DAC5REFH_DAC5R14_POSITION                          0x6
#define _DAC5REFH_DAC5R14_SIZE                              0x1
#define _DAC5REFH_DAC5R14_LENGTH                            0x1
#define _DAC5REFH_DAC5R14_MASK                              0x40
#define _DAC5REFH_DAC5R15_POSN                              0x7
#define _DAC5REFH_DAC5R15_POSITION                          0x7
#define _DAC5REFH_DAC5R15_SIZE                              0x1
#define _DAC5REFH_DAC5R15_LENGTH                            0x1
#define _DAC5REFH_DAC5R15_MASK                              0x80
#define _DAC5REFH_REF8_POSN                                 0x0
#define _DAC5REFH_REF8_POSITION                             0x0
#define _DAC5REFH_REF8_SIZE                                 0x1
#define _DAC5REFH_REF8_LENGTH                               0x1
#define _DAC5REFH_REF8_MASK                                 0x1
#define _DAC5REFH_REF9_POSN                                 0x1
#define _DAC5REFH_REF9_POSITION                             0x1
#define _DAC5REFH_REF9_SIZE                                 0x1
#define _DAC5REFH_REF9_LENGTH                               0x1
#define _DAC5REFH_REF9_MASK                                 0x2
#define _DAC5REFH_REF10_POSN                                0x2
#define _DAC5REFH_REF10_POSITION                            0x2
#define _DAC5REFH_REF10_SIZE                                0x1
#define _DAC5REFH_REF10_LENGTH                              0x1
#define _DAC5REFH_REF10_MASK                                0x4
#define _DAC5REFH_REF11_POSN                                0x3
#define _DAC5REFH_REF11_POSITION                            0x3
#define _DAC5REFH_REF11_SIZE                                0x1
#define _DAC5REFH_REF11_LENGTH                              0x1
#define _DAC5REFH_REF11_MASK                                0x8
#define _DAC5REFH_REF12_POSN                                0x4
#define _DAC5REFH_REF12_POSITION                            0x4
#define _DAC5REFH_REF12_SIZE                                0x1
#define _DAC5REFH_REF12_LENGTH                              0x1
#define _DAC5REFH_REF12_MASK                                0x10
#define _DAC5REFH_REF13_POSN                                0x5
#define _DAC5REFH_REF13_POSITION                            0x5
#define _DAC5REFH_REF13_SIZE                                0x1
#define _DAC5REFH_REF13_LENGTH                              0x1
#define _DAC5REFH_REF13_MASK                                0x20
#define _DAC5REFH_REF14_POSN                                0x6
#define _DAC5REFH_REF14_POSITION                            0x6
#define _DAC5REFH_REF14_SIZE                                0x1
#define _DAC5REFH_REF14_LENGTH                              0x1
#define _DAC5REFH_REF14_MASK                                0x40
#define _DAC5REFH_REF15_POSN                                0x7
#define _DAC5REFH_REF15_POSITION                            0x7
#define _DAC5REFH_REF15_SIZE                                0x1
#define _DAC5REFH_REF15_LENGTH                              0x1
#define _DAC5REFH_REF15_MASK                                0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC5REF8               :1;
        unsigned DAC5REF9               :1;
        unsigned DAC5REF10              :1;
        unsigned DAC5REF11              :1;
        unsigned DAC5REF12              :1;
        unsigned DAC5REF13              :1;
        unsigned DAC5REF14              :1;
        unsigned DAC5REF15              :1;
    };
    struct {
        unsigned R8                     :1;
        unsigned R9                     :1;
        unsigned R10                    :1;
        unsigned R11                    :1;
        unsigned R12                    :1;
        unsigned R13                    :1;
        unsigned R14                    :1;
        unsigned R15                    :1;
    };
    struct {
        unsigned DAC5R8                 :1;
        unsigned DAC5R9                 :1;
        unsigned DAC5R10                :1;
        unsigned DAC5R11                :1;
        unsigned DAC5R12                :1;
        unsigned DAC5R13                :1;
        unsigned DAC5R14                :1;
        unsigned DAC5R15                :1;
    };
    struct {
        unsigned REF8                   :1;
        unsigned REF9                   :1;
        unsigned REF10                  :1;
        unsigned REF11                  :1;
        unsigned REF12                  :1;
        unsigned REF13                  :1;
        unsigned REF14                  :1;
        unsigned REF15                  :1;
    };
} DAC5CON2bits_t;
