MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1778/mcu.h
extern volatile COG2FIS0bits_t COG2FIS0bits __at(0x719);
// bitfield macros
#define _COG2FIS0_FIS0_POSN                                 0x0
#define _COG2FIS0_FIS0_POSITION                             0x0
#define _COG2FIS0_FIS0_SIZE                                 0x1
#define _COG2FIS0_FIS0_LENGTH                               0x1
#define _COG2FIS0_FIS0_MASK                                 0x1
#define _COG2FIS0_FIS1_POSN                                 0x1
#define _COG2FIS0_FIS1_POSITION                             0x1
#define _COG2FIS0_FIS1_SIZE                                 0x1
#define _COG2FIS0_FIS1_LENGTH                               0x1
#define _COG2FIS0_FIS1_MASK                                 0x2
#define _COG2FIS0_FIS2_POSN                                 0x2
#define _COG2FIS0_FIS2_POSITION                             0x2
#define _COG2FIS0_FIS2_SIZE                                 0x1
#define _COG2FIS0_FIS2_LENGTH                               0x1
#define _COG2FIS0_FIS2_MASK                                 0x4
#define _COG2FIS0_FIS3_POSN                                 0x3
#define _COG2FIS0_FIS3_POSITION                             0x3
#define _COG2FIS0_FIS3_SIZE                                 0x1
#define _COG2FIS0_FIS3_LENGTH                               0x1
#define _COG2FIS0_FIS3_MASK                                 0x8
#define _COG2FIS0_FIS4_POSN                                 0x4
#define _COG2FIS0_FIS4_POSITION                             0x4
#define _COG2FIS0_FIS4_SIZE                                 0x1
#define _COG2FIS0_FIS4_LENGTH                               0x1
#define _COG2FIS0_FIS4_MASK                                 0x10
#define _COG2FIS0_FIS5_POSN                                 0x5
#define _COG2FIS0_FIS5_POSITION                             0x5
#define _COG2FIS0_FIS5_SIZE                                 0x1
#define _COG2FIS0_FIS5_LENGTH                               0x1
#define _COG2FIS0_FIS5_MASK                                 0x20
#define _COG2FIS0_FIS6_POSN                                 0x6
#define _COG2FIS0_FIS6_POSITION                             0x6
#define _COG2FIS0_FIS6_SIZE                                 0x1
#define _COG2FIS0_FIS6_LENGTH                               0x1
#define _COG2FIS0_FIS6_MASK                                 0x40
#define _COG2FIS0_FIS7_POSN                                 0x7
#define _COG2FIS0_FIS7_POSITION                             0x7
#define _COG2FIS0_FIS7_SIZE                                 0x1
#define _COG2FIS0_FIS7_LENGTH                               0x1
#define _COG2FIS0_FIS7_MASK                                 0x80
#define _COG2FIS0_G2FIS0_POSN                               0x0
#define _COG2FIS0_G2FIS0_POSITION                           0x0
#define _COG2FIS0_G2FIS0_SIZE                               0x1
#define _COG2FIS0_G2FIS0_LENGTH                             0x1
#define _COG2FIS0_G2FIS0_MASK                               0x1
#define _COG2FIS0_G2FIS1_POSN                               0x1
#define _COG2FIS0_G2FIS1_POSITION                           0x1
#define _COG2FIS0_G2FIS1_SIZE                               0x1
#define _COG2FIS0_G2FIS1_LENGTH                             0x1
#define _COG2FIS0_G2FIS1_MASK                               0x2
#define _COG2FIS0_G2FIS2_POSN                               0x2
#define _COG2FIS0_G2FIS2_POSITION                           0x2
#define _COG2FIS0_G2FIS2_SIZE                               0x1
#define _COG2FIS0_G2FIS2_LENGTH                             0x1
#define _COG2FIS0_G2FIS2_MASK                               0x4
#define _COG2FIS0_G2FIS3_POSN                               0x3
#define _COG2FIS0_G2FIS3_POSITION                           0x3
#define _COG2FIS0_G2FIS3_SIZE                               0x1
#define _COG2FIS0_G2FIS3_LENGTH                             0x1
#define _COG2FIS0_G2FIS3_MASK                               0x8
#define _COG2FIS0_G2FIS4_POSN                               0x4
#define _COG2FIS0_G2FIS4_POSITION                           0x4
#define _COG2FIS0_G2FIS4_SIZE                               0x1
#define _COG2FIS0_G2FIS4_LENGTH                             0x1
#define _COG2FIS0_G2FIS4_MASK                               0x10
#define _COG2FIS0_G2FIS5_POSN                               0x5
#define _COG2FIS0_G2FIS5_POSITION                           0x5
#define _COG2FIS0_G2FIS5_SIZE                               0x1
#define _COG2FIS0_G2FIS5_LENGTH                             0x1
#define _COG2FIS0_G2FIS5_MASK                               0x20
#define _COG2FIS0_G2FIS6_POSN                               0x6
#define _COG2FIS0_G2FIS6_POSITION                           0x6
#define _COG2FIS0_G2FIS6_SIZE                               0x1
#define _COG2FIS0_G2FIS6_LENGTH                             0x1
#define _COG2FIS0_G2FIS6_MASK                               0x40
#define _COG2FIS0_G2FIS7_POSN                               0x7
#define _COG2FIS0_G2FIS7_POSITION                           0x7
#define _COG2FIS0_G2FIS7_SIZE                               0x1
#define _COG2FIS0_G2FIS7_LENGTH                             0x1
#define _COG2FIS0_G2FIS7_MASK                               0x80

// Register: COG2FIS1
#define COG2FIS1 COG2FIS1
extern volatile unsigned char           COG2FIS1            __at(0x71A);
#ifndef _LIB_BUILD
asm("COG2FIS1 equ 071Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIS8                   :1;
        unsigned FIS9                   :1;
        unsigned FIS10                  :1;
        unsigned FIS11                  :1;
        unsigned FIS12                  :1;
        unsigned FIS13                  :1;
        unsigned FIS14                  :1;
        unsigned FIS15                  :1;
    };
    struct {
        unsigned G2FIS8                 :1;
        unsigned G2FIS9                 :1;
        unsigned G2FIS10                :1;
        unsigned G2FIS11                :1;
        unsigned G2FIS12                :1;
        unsigned G2FIS13                :1;
        unsigned G2FIS14                :1;
        unsigned G2FIS15                :1;
    };
} COG2FIS1bits_t;
extern volatile COG2FIS1bits_t COG2FIS1bits __at(0x71A);
// bitfield macros
#define _COG2FIS1_FIS8_POSN                                 0x0
#define _COG2FIS1_FIS8_POSITION                             0x0
#define _COG2FIS1_FIS8_SIZE                                 0x1
#define _COG2FIS1_FIS8_LENGTH                               0x1
#define _COG2FIS1_FIS8_MASK                                 0x1
#define _COG2FIS1_FIS9_POSN                                 0x1
#define _COG2FIS1_FIS9_POSITION                             0x1
#define _COG2FIS1_FIS9_SIZE                                 0x1
#define _COG2FIS1_FIS9_LENGTH                               0x1
#define _COG2FIS1_FIS9_MASK                                 0x2
#define _COG2FIS1_FIS10_POSN                                0x2
#define _COG2FIS1_FIS10_POSITION                            0x2
#define _COG2FIS1_FIS10_SIZE                                0x1
#define _COG2FIS1_FIS10_LENGTH                              0x1
#define _COG2FIS1_FIS10_MASK                                0x4
#define _COG2FIS1_FIS11_POSN                                0x3
#define _COG2FIS1_FIS11_POSITION                            0x3
#define _COG2FIS1_FIS11_SIZE                                0x1
#define _COG2FIS1_FIS11_LENGTH                              0x1
#define _COG2FIS1_FIS11_MASK                                0x8
#define _COG2FIS1_FIS12_POSN                                0x4
#define _COG2FIS1_FIS12_POSITION                            0x4
#define _COG2FIS1_FIS12_SIZE                                0x1
#define _COG2FIS1_FIS12_LENGTH                              0x1
#define _COG2FIS1_FIS12_MASK                                0x10
#define _COG2FIS1_FIS13_POSN                                0x5
#define _COG2FIS1_FIS13_POSITION                            0x5
#define _COG2FIS1_FIS13_SIZE                                0x1
#define _COG2FIS1_FIS13_LENGTH                              0x1
#define _COG2FIS1_FIS13_MASK                                0x20
#define _COG2FIS1_FIS14_POSN                                0x6
#define _COG2FIS1_FIS14_POSITION                            0x6
#define _COG2FIS1_FIS14_SIZE                                0x1
#define _COG2FIS1_FIS14_LENGTH                              0x1
#define _COG2FIS1_FIS14_MASK                                0x40
#define _COG2FIS1_FIS15_POSN                                0x7
#define _COG2FIS1_FIS15_POSITION                            0x7
#define _COG2FIS1_FIS15_SIZE                                0x1
#define _COG2FIS1_FIS15_LENGTH                              0x1
#define _COG2FIS1_FIS15_MASK                                0x80
#define _COG2FIS1_G2FIS8_POSN                               0x0
#define _COG2FIS1_G2FIS8_POSITION                           0x0
#define _COG2FIS1_G2FIS8_SIZE                               0x1
#define _COG2FIS1_G2FIS8_LENGTH                             0x1
#define _COG2FIS1_G2FIS8_MASK                               0x1
#define _COG2FIS1_G2FIS9_POSN                               0x1
#define _COG2FIS1_G2FIS9_POSITION                           0x1
#define _COG2FIS1_G2FIS9_SIZE                               0x1
#define _COG2FIS1_G2FIS9_LENGTH                             0x1
#define _COG2FIS1_G2FIS9_MASK                               0x2
#define _COG2FIS1_G2FIS10_POSN                              0x2
#define _COG2FIS1_G2FIS10_POSITION                          0x2
#define _COG2FIS1_G2FIS10_SIZE                              0x1
#define _COG2FIS1_G2FIS10_LENGTH                            0x1
#define _COG2FIS1_G2FIS10_MASK                              0x4
#define _COG2FIS1_G2FIS11_POSN                              0x3
#define _COG2FIS1_G2FIS11_POSITION                          0x3
#define _COG2FIS1_G2FIS11_SIZE                              0x1
#define _COG2FIS1_G2FIS11_LENGTH                            0x1
#define _COG2FIS1_G2FIS11_MASK                              0x8
#define _COG2FIS1_G2FIS12_POSN                              0x4
#define _COG2FIS1_G2FIS12_POSITION                          0x4
#define _COG2FIS1_G2FIS12_SIZE                              0x1
#define _COG2FIS1_G2FIS12_LENGTH                            0x1
#define _COG2FIS1_G2FIS12_MASK                              0x10
#define _COG2FIS1_G2FIS13_POSN                              0x5
#define _COG2FIS1_G2FIS13_POSITION                          0x5
#define _COG2FIS1_G2FIS13_SIZE                              0x1
#define _COG2FIS1_G2FIS13_LENGTH                            0x1
#define _COG2FIS1_G2FIS13_MASK                              0x20
#define _COG2FIS1_G2FIS14_POSN                              0x6
#define _COG2FIS1_G2FIS14_POSITION                          0x6
#define _COG2FIS1_G2FIS14_SIZE                              0x1
#define _COG2FIS1_G2FIS14_LENGTH                            0x1
#define _COG2FIS1_G2FIS14_MASK                              0x40
#define _COG2FIS1_G2FIS15_POSN                              0x7
#define _COG2FIS1_G2FIS15_POSITION                          0x7
#define _COG2FIS1_G2FIS15_SIZE                              0x1
#define _COG2FIS1_G2FIS15_LENGTH                            0x1
#define _COG2FIS1_G2FIS15_MASK                              0x80

// Register: COG2FSIM0
#define COG2FSIM0 COG2FSIM0
extern volatile unsigned char           COG2FSIM0           __at(0x71B);
#ifndef _LIB_BUILD
asm("COG2FSIM0 equ 071Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSIM0                  :1;
        unsigned FSIM1                  :1;
        unsigned FSIM2                  :1;
        unsigned FSIM3                  :1;
        unsigned FSIM4                  :1;
        unsigned FSIM5                  :1;
        unsigned FSIM6                  :1;
        unsigned FSIM7                  :1;
    };
    struct {
        unsigned G2FSIM0                :1;
        unsigned G2FSIM1                :1;
        unsigned G2FSIM2                :1;
        unsigned G2FSIM3                :1;
        unsigned G2FSIM4                :1;
        unsigned G2FSIM5                :1;
        unsigned G2FSIM6                :1;
        unsigned G2FSIM7                :1;
    };
} COG2FSIM0bits_t;
