MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1778/mcu.h
extern volatile MD3CLPPSbits_t MD3CLPPSbits __at(0xE27);
// bitfield macros
#define _MD3CLPPS_MD3CLPPS_POSN                             0x0
#define _MD3CLPPS_MD3CLPPS_POSITION                         0x0
#define _MD3CLPPS_MD3CLPPS_SIZE                             0x6
#define _MD3CLPPS_MD3CLPPS_LENGTH                           0x6
#define _MD3CLPPS_MD3CLPPS_MASK                             0x3F

// Register: MD3CHPPS
#define MD3CHPPS MD3CHPPS
extern volatile unsigned char           MD3CHPPS            __at(0xE28);
#ifndef _LIB_BUILD
asm("MD3CHPPS equ 0E28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD3CHPPS               :6;
    };
} MD3CHPPSbits_t;
extern volatile MD3CHPPSbits_t MD3CHPPSbits __at(0xE28);
// bitfield macros
#define _MD3CHPPS_MD3CHPPS_POSN                             0x0
#define _MD3CHPPS_MD3CHPPS_POSITION                         0x0
#define _MD3CHPPS_MD3CHPPS_SIZE                             0x6
#define _MD3CHPPS_MD3CHPPS_LENGTH                           0x6
#define _MD3CHPPS_MD3CHPPS_MASK                             0x3F

// Register: MD3MODPPS
#define MD3MODPPS MD3MODPPS
extern volatile unsigned char           MD3MODPPS           __at(0xE29);
#ifndef _LIB_BUILD
asm("MD3MODPPS equ 0E29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD3MODPPS              :6;
    };
} MD3MODPPSbits_t;
extern volatile MD3MODPPSbits_t MD3MODPPSbits __at(0xE29);
// bitfield macros
#define _MD3MODPPS_MD3MODPPS_POSN                           0x0
#define _MD3MODPPS_MD3MODPPS_POSITION                       0x0
#define _MD3MODPPS_MD3MODPPS_SIZE                           0x6
#define _MD3MODPPS_MD3MODPPS_LENGTH                         0x6
#define _MD3MODPPS_MD3MODPPS_MASK                           0x3F

// Register: PRG1RPPS
#define PRG1RPPS PRG1RPPS
extern volatile unsigned char           PRG1RPPS            __at(0xE2D);
#ifndef _LIB_BUILD
asm("PRG1RPPS equ 0E2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG1RPPS               :6;
    };
} PRG1RPPSbits_t;
extern volatile PRG1RPPSbits_t PRG1RPPSbits __at(0xE2D);
// bitfield macros
#define _PRG1RPPS_PRG1RPPS_POSN                             0x0
#define _PRG1RPPS_PRG1RPPS_POSITION                         0x0
#define _PRG1RPPS_PRG1RPPS_SIZE                             0x6
#define _PRG1RPPS_PRG1RPPS_LENGTH                           0x6
#define _PRG1RPPS_PRG1RPPS_MASK                             0x3F

// Register: PRG1FPPS
#define PRG1FPPS PRG1FPPS
extern volatile unsigned char           PRG1FPPS            __at(0xE2E);
#ifndef _LIB_BUILD
asm("PRG1FPPS equ 0E2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG1FPPS               :6;
    };
} PRG1FPPSbits_t;
extern volatile PRG1FPPSbits_t PRG1FPPSbits __at(0xE2E);
// bitfield macros
#define _PRG1FPPS_PRG1FPPS_POSN                             0x0
#define _PRG1FPPS_PRG1FPPS_POSITION                         0x0
#define _PRG1FPPS_PRG1FPPS_SIZE                             0x6
#define _PRG1FPPS_PRG1FPPS_LENGTH                           0x6
#define _PRG1FPPS_PRG1FPPS_MASK                             0x3F

// Register: PRG2RPPS
#define PRG2RPPS PRG2RPPS
extern volatile unsigned char           PRG2RPPS            __at(0xE2F);
#ifndef _LIB_BUILD
asm("PRG2RPPS equ 0E2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG2RPPS               :6;
    };
} PRG2RPPSbits_t;
extern volatile PRG2RPPSbits_t PRG2RPPSbits __at(0xE2F);
// bitfield macros
#define _PRG2RPPS_PRG2RPPS_POSN                             0x0
#define _PRG2RPPS_PRG2RPPS_POSITION                         0x0
#define _PRG2RPPS_PRG2RPPS_SIZE                             0x6
#define _PRG2RPPS_PRG2RPPS_LENGTH                           0x6
#define _PRG2RPPS_PRG2RPPS_MASK                             0x3F

// Register: PRG2FPPS
#define PRG2FPPS PRG2FPPS
extern volatile unsigned char           PRG2FPPS            __at(0xE30);
#ifndef _LIB_BUILD
asm("PRG2FPPS equ 0E30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG2FPPS               :6;
    };
} PRG2FPPSbits_t;
extern volatile PRG2FPPSbits_t PRG2FPPSbits __at(0xE30);
// bitfield macros
#define _PRG2FPPS_PRG2FPPS_POSN                             0x0
#define _PRG2FPPS_PRG2FPPS_POSITION                         0x0
#define _PRG2FPPS_PRG2FPPS_SIZE                             0x6
#define _PRG2FPPS_PRG2FPPS_LENGTH                           0x6
#define _PRG2FPPS_PRG2FPPS_MASK                             0x3F

// Register: PRG3RPPS
#define PRG3RPPS PRG3RPPS
extern volatile unsigned char           PRG3RPPS            __at(0xE31);
#ifndef _LIB_BUILD
asm("PRG3RPPS equ 0E31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG3RPPS               :6;
    };
} PRG3RPPSbits_t;
extern volatile PRG3RPPSbits_t PRG3RPPSbits __at(0xE31);
// bitfield macros
#define _PRG3RPPS_PRG3RPPS_POSN                             0x0
#define _PRG3RPPS_PRG3RPPS_POSITION                         0x0
#define _PRG3RPPS_PRG3RPPS_SIZE                             0x6
#define _PRG3RPPS_PRG3RPPS_LENGTH                           0x6
#define _PRG3RPPS_PRG3RPPS_MASK                             0x3F

// Register: PRG3FPPS
#define PRG3FPPS PRG3FPPS
extern volatile unsigned char           PRG3FPPS            __at(0xE32);
#ifndef _LIB_BUILD
asm("PRG3FPPS equ 0E32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG3FPPS               :6;
    };
} PRG3FPPSbits_t;
extern volatile PRG3FPPSbits_t PRG3FPPSbits __at(0xE32);
// bitfield macros
#define _PRG3FPPS_PRG3FPPS_POSN                             0x0
#define _PRG3FPPS_PRG3FPPS_POSITION                         0x0
#define _PRG3FPPS_PRG3FPPS_SIZE                             0x6
#define _PRG3FPPS_PRG3FPPS_LENGTH                           0x6
#define _PRG3FPPS_PRG3FPPS_MASK                             0x3F

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
extern volatile unsigned char           CLCIN0PPS           __at(0xE35);
#ifndef _LIB_BUILD
asm("CLCIN0PPS equ 0E35h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN0PPS              :6;
    };
} CLCIN0PPSbits_t;
extern volatile CLCIN0PPSbits_t CLCIN0PPSbits __at(0xE35);
// bitfield macros
#define _CLCIN0PPS_CLCIN0PPS_POSN                           0x0
#define _CLCIN0PPS_CLCIN0PPS_POSITION                       0x0
#define _CLCIN0PPS_CLCIN0PPS_SIZE                           0x6
#define _CLCIN0PPS_CLCIN0PPS_LENGTH                         0x6
#define _CLCIN0PPS_CLCIN0PPS_MASK                           0x3F

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
extern volatile unsigned char           CLCIN1PPS           __at(0xE36);
#ifndef _LIB_BUILD
asm("CLCIN1PPS equ 0E36h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN1PPS              :6;
    };
} CLCIN1PPSbits_t;
extern volatile CLCIN1PPSbits_t CLCIN1PPSbits __at(0xE36);
// bitfield macros
#define _CLCIN1PPS_CLCIN1PPS_POSN                           0x0
#define _CLCIN1PPS_CLCIN1PPS_POSITION                       0x0
#define _CLCIN1PPS_CLCIN1PPS_SIZE                           0x6
#define _CLCIN1PPS_CLCIN1PPS_LENGTH                         0x6
#define _CLCIN1PPS_CLCIN1PPS_MASK                           0x3F

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
extern volatile unsigned char           CLCIN2PPS           __at(0xE37);
#ifndef _LIB_BUILD
asm("CLCIN2PPS equ 0E37h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN2PPS              :6;
    };
} CLCIN2PPSbits_t;
extern volatile CLCIN2PPSbits_t CLCIN2PPSbits __at(0xE37);
// bitfield macros
#define _CLCIN2PPS_CLCIN2PPS_POSN                           0x0
#define _CLCIN2PPS_CLCIN2PPS_POSITION                       0x0
#define _CLCIN2PPS_CLCIN2PPS_SIZE                           0x6
#define _CLCIN2PPS_CLCIN2PPS_LENGTH                         0x6
#define _CLCIN2PPS_CLCIN2PPS_MASK                           0x3F

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
extern volatile unsigned char           CLCIN3PPS           __at(0xE38);
#ifndef _LIB_BUILD
asm("CLCIN3PPS equ 0E38h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN3PPS              :6;
    };
} CLCIN3PPSbits_t;
extern volatile CLCIN3PPSbits_t CLCIN3PPSbits __at(0xE38);
// bitfield macros
#define _CLCIN3PPS_CLCIN3PPS_POSN                           0x0
#define _CLCIN3PPS_CLCIN3PPS_POSITION                       0x0
#define _CLCIN3PPS_CLCIN3PPS_SIZE                           0x6
#define _CLCIN3PPS_CLCIN3PPS_LENGTH                         0x6
#define _CLCIN3PPS_CLCIN3PPS_MASK                           0x3F

// Register: ADCACTPPS
#define ADCACTPPS ADCACTPPS
extern volatile unsigned char           ADCACTPPS           __at(0xE39);
#ifndef _LIB_BUILD
asm("ADCACTPPS equ 0E39h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCACTPPS              :6;
    };
} ADCACTPPSbits_t;
extern volatile ADCACTPPSbits_t ADCACTPPSbits __at(0xE39);
// bitfield macros
#define _ADCACTPPS_ADCACTPPS_POSN                           0x0
#define _ADCACTPPS_ADCACTPPS_POSITION                       0x0
#define _ADCACTPPS_ADCACTPPS_SIZE                           0x6
#define _ADCACTPPS_ADCACTPPS_LENGTH                         0x6
#define _ADCACTPPS_ADCACTPPS_MASK                           0x3F

// Register: SSPCLKPPS
#define SSPCLKPPS SSPCLKPPS
extern volatile unsigned char           SSPCLKPPS           __at(0xE3A);
#ifndef _LIB_BUILD
asm("SSPCLKPPS equ 0E3Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPCLKPPS              :6;
    };
} SSPCLKPPSbits_t;
