MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1778/mcu.h
#define                                 DAC5R11_bit         _BIT_ACCESS(DAC5REFH,3)
// DAC5REFH<DAC5R12>
extern volatile __bit                   DAC5R12             __at(0x2CD4);	// @ (0x59A * 8 + 4)
#define                                 DAC5R12_bit         _BIT_ACCESS(DAC5REFH,4)
// DAC5REFH<DAC5R13>
extern volatile __bit                   DAC5R13             __at(0x2CD5);	// @ (0x59A * 8 + 5)
#define                                 DAC5R13_bit         _BIT_ACCESS(DAC5REFH,5)
// DAC5REFH<DAC5R14>
extern volatile __bit                   DAC5R14             __at(0x2CD6);	// @ (0x59A * 8 + 6)
#define                                 DAC5R14_bit         _BIT_ACCESS(DAC5REFH,6)
// DAC5REFH<DAC5R15>
extern volatile __bit                   DAC5R15             __at(0x2CD7);	// @ (0x59A * 8 + 7)
#define                                 DAC5R15_bit         _BIT_ACCESS(DAC5REFH,7)
// DAC5REFL<DAC5R2>
extern volatile __bit                   DAC5R2              __at(0x2CCA);	// @ (0x599 * 8 + 2)
#define                                 DAC5R2_bit          _BIT_ACCESS(DAC5REFL,2)
// DAC5REFL<DAC5R3>
extern volatile __bit                   DAC5R3              __at(0x2CCB);	// @ (0x599 * 8 + 3)
#define                                 DAC5R3_bit          _BIT_ACCESS(DAC5REFL,3)
// DAC5REFL<DAC5R4>
extern volatile __bit                   DAC5R4              __at(0x2CCC);	// @ (0x599 * 8 + 4)
#define                                 DAC5R4_bit          _BIT_ACCESS(DAC5REFL,4)
// DAC5REFL<DAC5R5>
extern volatile __bit                   DAC5R5              __at(0x2CCD);	// @ (0x599 * 8 + 5)
#define                                 DAC5R5_bit          _BIT_ACCESS(DAC5REFL,5)
// DAC5REFL<DAC5R6>
extern volatile __bit                   DAC5R6              __at(0x2CCE);	// @ (0x599 * 8 + 6)
#define                                 DAC5R6_bit          _BIT_ACCESS(DAC5REFL,6)
// DAC5REFL<DAC5R7>
extern volatile __bit                   DAC5R7              __at(0x2CCF);	// @ (0x599 * 8 + 7)
#define                                 DAC5R7_bit          _BIT_ACCESS(DAC5REFL,7)
// DAC5REFH<DAC5R8>
extern volatile __bit                   DAC5R8              __at(0x2CD0);	// @ (0x59A * 8 + 0)
#define                                 DAC5R8_bit          _BIT_ACCESS(DAC5REFH,0)
// DAC5REFH<DAC5R9>
extern volatile __bit                   DAC5R9              __at(0x2CD1);	// @ (0x59A * 8 + 1)
#define                                 DAC5R9_bit          _BIT_ACCESS(DAC5REFH,1)
// DAC5REFL<DAC5REF0>
extern volatile __bit                   DAC5REF0            __at(0x2CC8);	// @ (0x599 * 8 + 0)
#define                                 DAC5REF0_bit        _BIT_ACCESS(DAC5REFL,0)
// DAC5REFL<DAC5REF1>
extern volatile __bit                   DAC5REF1            __at(0x2CC9);	// @ (0x599 * 8 + 1)
#define                                 DAC5REF1_bit        _BIT_ACCESS(DAC5REFL,1)
// DAC5REFH<DAC5REF10>
extern volatile __bit                   DAC5REF10           __at(0x2CD2);	// @ (0x59A * 8 + 2)
#define                                 DAC5REF10_bit       _BIT_ACCESS(DAC5REFH,2)
// DAC5REFH<DAC5REF11>
extern volatile __bit                   DAC5REF11           __at(0x2CD3);	// @ (0x59A * 8 + 3)
#define                                 DAC5REF11_bit       _BIT_ACCESS(DAC5REFH,3)
// DAC5REFH<DAC5REF12>
extern volatile __bit                   DAC5REF12           __at(0x2CD4);	// @ (0x59A * 8 + 4)
#define                                 DAC5REF12_bit       _BIT_ACCESS(DAC5REFH,4)
// DAC5REFH<DAC5REF13>
extern volatile __bit                   DAC5REF13           __at(0x2CD5);	// @ (0x59A * 8 + 5)
#define                                 DAC5REF13_bit       _BIT_ACCESS(DAC5REFH,5)
// DAC5REFH<DAC5REF14>
extern volatile __bit                   DAC5REF14           __at(0x2CD6);	// @ (0x59A * 8 + 6)
#define                                 DAC5REF14_bit       _BIT_ACCESS(DAC5REFH,6)
// DAC5REFH<DAC5REF15>
extern volatile __bit                   DAC5REF15           __at(0x2CD7);	// @ (0x59A * 8 + 7)
#define                                 DAC5REF15_bit       _BIT_ACCESS(DAC5REFH,7)
// DAC5REFL<DAC5REF2>
extern volatile __bit                   DAC5REF2            __at(0x2CCA);	// @ (0x599 * 8 + 2)
#define                                 DAC5REF2_bit        _BIT_ACCESS(DAC5REFL,2)
// DAC5REFL<DAC5REF3>
extern volatile __bit                   DAC5REF3            __at(0x2CCB);	// @ (0x599 * 8 + 3)
#define                                 DAC5REF3_bit        _BIT_ACCESS(DAC5REFL,3)
// DAC5REFL<DAC5REF4>
extern volatile __bit                   DAC5REF4            __at(0x2CCC);	// @ (0x599 * 8 + 4)
#define                                 DAC5REF4_bit        _BIT_ACCESS(DAC5REFL,4)
// DAC5REFL<DAC5REF5>
extern volatile __bit                   DAC5REF5            __at(0x2CCD);	// @ (0x599 * 8 + 5)
#define                                 DAC5REF5_bit        _BIT_ACCESS(DAC5REFL,5)
// DAC5REFL<DAC5REF6>
extern volatile __bit                   DAC5REF6            __at(0x2CCE);	// @ (0x599 * 8 + 6)
#define                                 DAC5REF6_bit        _BIT_ACCESS(DAC5REFL,6)
// DAC5REFL<DAC5REF7>
extern volatile __bit                   DAC5REF7            __at(0x2CCF);	// @ (0x599 * 8 + 7)
#define                                 DAC5REF7_bit        _BIT_ACCESS(DAC5REFL,7)
// DAC5REFH<DAC5REF8>
extern volatile __bit                   DAC5REF8            __at(0x2CD0);	// @ (0x59A * 8 + 0)
#define                                 DAC5REF8_bit        _BIT_ACCESS(DAC5REFH,0)
// DAC5REFH<DAC5REF9>
extern volatile __bit                   DAC5REF9            __at(0x2CD1);	// @ (0x59A * 8 + 1)
#define                                 DAC5REF9_bit        _BIT_ACCESS(DAC5REFH,1)
// DAC7CON0<DAC7EN>
extern volatile __bit                   DAC7EN              __at(0x2CF7);	// @ (0x59E * 8 + 7)
#define                                 DAC7EN_bit          _BIT_ACCESS(DAC7CON0,7)
// DAC7CON0<DAC7NSS0>
extern volatile __bit                   DAC7NSS0            __at(0x2CF0);	// @ (0x59E * 8 + 0)
#define                                 DAC7NSS0_bit        _BIT_ACCESS(DAC7CON0,0)
// DAC7CON0<DAC7NSS1>
extern volatile __bit                   DAC7NSS1            __at(0x2CF1);	// @ (0x59E * 8 + 1)
#define                                 DAC7NSS1_bit        _BIT_ACCESS(DAC7CON0,1)
// DAC7CON0<DAC7OE1>
extern volatile __bit                   DAC7OE1             __at(0x2CF5);	// @ (0x59E * 8 + 5)
#define                                 DAC7OE1_bit         _BIT_ACCESS(DAC7CON0,5)
// DAC7CON0<DAC7OE2>
extern volatile __bit                   DAC7OE2             __at(0x2CF4);	// @ (0x59E * 8 + 4)
#define                                 DAC7OE2_bit         _BIT_ACCESS(DAC7CON0,4)
// DAC7CON0<DAC7PSS0>
extern volatile __bit                   DAC7PSS0            __at(0x2CF2);	// @ (0x59E * 8 + 2)
#define                                 DAC7PSS0_bit        _BIT_ACCESS(DAC7CON0,2)
// DAC7CON0<DAC7PSS1>
extern volatile __bit                   DAC7PSS1            __at(0x2CF3);	// @ (0x59E * 8 + 3)
#define                                 DAC7PSS1_bit        _BIT_ACCESS(DAC7CON0,3)
// DAC7REF<DAC7R0>
extern volatile __bit                   DAC7R0              __at(0x2CF8);	// @ (0x59F * 8 + 0)
#define                                 DAC7R0_bit          _BIT_ACCESS(DAC7REF,0)
// DAC7REF<DAC7R1>
extern volatile __bit                   DAC7R1              __at(0x2CF9);	// @ (0x59F * 8 + 1)
#define                                 DAC7R1_bit          _BIT_ACCESS(DAC7REF,1)
// DAC7REF<DAC7R2>
extern volatile __bit                   DAC7R2              __at(0x2CFA);	// @ (0x59F * 8 + 2)
#define                                 DAC7R2_bit          _BIT_ACCESS(DAC7REF,2)
// DAC7REF<DAC7R3>
extern volatile __bit                   DAC7R3              __at(0x2CFB);	// @ (0x59F * 8 + 3)
#define                                 DAC7R3_bit          _BIT_ACCESS(DAC7REF,3)
// DAC7REF<DAC7R4>
extern volatile __bit                   DAC7R4              __at(0x2CFC);	// @ (0x59F * 8 + 4)
#define                                 DAC7R4_bit          _BIT_ACCESS(DAC7REF,4)
// DAC7REF<DAC7REF0>
extern volatile __bit                   DAC7REF0            __at(0x2CF8);	// @ (0x59F * 8 + 0)
#define                                 DAC7REF0_bit        _BIT_ACCESS(DAC7REF,0)
// DAC7REF<DAC7REF1>
extern volatile __bit                   DAC7REF1            __at(0x2CF9);	// @ (0x59F * 8 + 1)
#define                                 DAC7REF1_bit        _BIT_ACCESS(DAC7REF,1)
// DAC7REF<DAC7REF2>
extern volatile __bit                   DAC7REF2            __at(0x2CFA);	// @ (0x59F * 8 + 2)
#define                                 DAC7REF2_bit        _BIT_ACCESS(DAC7REF,2)
// DAC7REF<DAC7REF3>
extern volatile __bit                   DAC7REF3            __at(0x2CFB);	// @ (0x59F * 8 + 3)
#define                                 DAC7REF3_bit        _BIT_ACCESS(DAC7REF,3)
// DAC7REF<DAC7REF4>
extern volatile __bit                   DAC7REF4            __at(0x2CFC);	// @ (0x59F * 8 + 4)
#define                                 DAC7REF4_bit        _BIT_ACCESS(DAC7REF,4)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// STATUS_SHAD<DC_SHAD>
extern volatile __bit                   DC_SHAD             __at(0x7F21);	// @ (0xFE4 * 8 + 1)
#define                                 DC_SHAD_bit         _BIT_ACCESS(STATUS_SHAD,1)
// SSP1CON3<DHEN>
extern volatile __bit                   DHEN                __at(0x10B8);	// @ (0x217 * 8 + 0)
#define                                 DHEN_bit            _BIT_ACCESS(SSP1CON3,0)
// SSP1STAT<D_nA>
extern volatile __bit                   D_nA                __at(0x10A5);	// @ (0x214 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// RC1STA<FERR>
extern volatile __bit                   FERR                __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RC1STA,2)
// PMCON1<FREE>
extern volatile __bit                   FREE                __at(0xCAC);	// @ (0x195 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(PMCON1,4)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// COG1ASD0<G1ARSEN>
extern volatile __bit                   G1ARSEN             __at(0x34EE);	// @ (0x69D * 8 + 6)
#define                                 G1ARSEN_bit         _BIT_ACCESS(COG1ASD0,6)
// COG1ASD1<G1AS0E>
extern volatile __bit                   G1AS0E              __at(0x34F0);	// @ (0x69E * 8 + 0)
#define                                 G1AS0E_bit          _BIT_ACCESS(COG1ASD1,0)
// COG1ASD1<G1AS1E>
extern volatile __bit                   G1AS1E              __at(0x34F1);	// @ (0x69E * 8 + 1)
#define                                 G1AS1E_bit          _BIT_ACCESS(COG1ASD1,1)
// COG1ASD1<G1AS2E>
extern volatile __bit                   G1AS2E              __at(0x34F2);	// @ (0x69E * 8 + 2)
#define                                 G1AS2E_bit          _BIT_ACCESS(COG1ASD1,2)
// COG1ASD1<G1AS3E>
extern volatile __bit                   G1AS3E              __at(0x34F3);	// @ (0x69E * 8 + 3)
#define                                 G1AS3E_bit          _BIT_ACCESS(COG1ASD1,3)
// COG1ASD1<G1AS4E>
extern volatile __bit                   G1AS4E              __at(0x34F4);	// @ (0x69E * 8 + 4)
#define                                 G1AS4E_bit          _BIT_ACCESS(COG1ASD1,4)
// COG1ASD1<G1AS5E>
extern volatile __bit                   G1AS5E              __at(0x34F5);	// @ (0x69E * 8 + 5)
#define                                 G1AS5E_bit          _BIT_ACCESS(COG1ASD1,5)
// COG1ASD1<G1AS6E>
extern volatile __bit                   G1AS6E              __at(0x34F6);	// @ (0x69E * 8 + 6)
#define                                 G1AS6E_bit          _BIT_ACCESS(COG1ASD1,6)
// COG1ASD1<G1AS7E>
extern volatile __bit                   G1AS7E              __at(0x34F7);	// @ (0x69E * 8 + 7)
#define                                 G1AS7E_bit          _BIT_ACCESS(COG1ASD1,7)
// COG1ASD0<G1ASDAC0>
extern volatile __bit                   G1ASDAC0            __at(0x34EA);	// @ (0x69D * 8 + 2)
#define                                 G1ASDAC0_bit        _BIT_ACCESS(COG1ASD0,2)
// COG1ASD0<G1ASDAC1>
extern volatile __bit                   G1ASDAC1            __at(0x34EB);	// @ (0x69D * 8 + 3)
#define                                 G1ASDAC1_bit        _BIT_ACCESS(COG1ASD0,3)
// COG1ASD0<G1ASDBD0>
extern volatile __bit                   G1ASDBD0            __at(0x34EC);	// @ (0x69D * 8 + 4)
#define                                 G1ASDBD0_bit        _BIT_ACCESS(COG1ASD0,4)
// COG1ASD0<G1ASDBD1>
extern volatile __bit                   G1ASDBD1            __at(0x34ED);	// @ (0x69D * 8 + 5)
#define                                 G1ASDBD1_bit        _BIT_ACCESS(COG1ASD0,5)
// COG1ASD0<G1ASE>
extern volatile __bit                   G1ASE               __at(0x34EF);	// @ (0x69D * 8 + 7)
#define                                 G1ASE_bit           _BIT_ACCESS(COG1ASD0,7)
// COG1ASD0<G1ASREN>
extern volatile __bit                   G1ASREN             __at(0x34EE);	// @ (0x69D * 8 + 6)
#define                                 G1ASREN_bit         _BIT_ACCESS(COG1ASD0,6)
// COG1BLKF<G1BLKF0>
extern volatile __bit                   G1BLKF0             __at(0x3480);	// @ (0x690 * 8 + 0)
#define                                 G1BLKF0_bit         _BIT_ACCESS(COG1BLKF,0)
// COG1BLKF<G1BLKF1>
extern volatile __bit                   G1BLKF1             __at(0x3481);	// @ (0x690 * 8 + 1)
#define                                 G1BLKF1_bit         _BIT_ACCESS(COG1BLKF,1)
// COG1BLKF<G1BLKF2>
extern volatile __bit                   G1BLKF2             __at(0x3482);	// @ (0x690 * 8 + 2)
#define                                 G1BLKF2_bit         _BIT_ACCESS(COG1BLKF,2)
// COG1BLKF<G1BLKF3>
extern volatile __bit                   G1BLKF3             __at(0x3483);	// @ (0x690 * 8 + 3)
#define                                 G1BLKF3_bit         _BIT_ACCESS(COG1BLKF,3)
// COG1BLKF<G1BLKF4>
extern volatile __bit                   G1BLKF4             __at(0x3484);	// @ (0x690 * 8 + 4)
#define                                 G1BLKF4_bit         _BIT_ACCESS(COG1BLKF,4)
// COG1BLKF<G1BLKF5>
extern volatile __bit                   G1BLKF5             __at(0x3485);	// @ (0x690 * 8 + 5)
#define                                 G1BLKF5_bit         _BIT_ACCESS(COG1BLKF,5)
// COG1BLKR<G1BLKR0>
extern volatile __bit                   G1BLKR0             __at(0x3478);	// @ (0x68F * 8 + 0)
#define                                 G1BLKR0_bit         _BIT_ACCESS(COG1BLKR,0)
// COG1BLKR<G1BLKR1>
extern volatile __bit                   G1BLKR1             __at(0x3479);	// @ (0x68F * 8 + 1)
#define                                 G1BLKR1_bit         _BIT_ACCESS(COG1BLKR,1)
// COG1BLKR<G1BLKR2>
extern volatile __bit                   G1BLKR2             __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 G1BLKR2_bit         _BIT_ACCESS(COG1BLKR,2)
// COG1BLKR<G1BLKR3>
extern volatile __bit                   G1BLKR3             __at(0x347B);	// @ (0x68F * 8 + 3)
#define                                 G1BLKR3_bit         _BIT_ACCESS(COG1BLKR,3)
// COG1BLKR<G1BLKR4>
extern volatile __bit                   G1BLKR4             __at(0x347C);	// @ (0x68F * 8 + 4)
#define                                 G1BLKR4_bit         _BIT_ACCESS(COG1BLKR,4)
// COG1BLKR<G1BLKR5>
extern volatile __bit                   G1BLKR5             __at(0x347D);	// @ (0x68F * 8 + 5)
#define                                 G1BLKR5_bit         _BIT_ACCESS(COG1BLKR,5)
// COG1CON0<G1CS0>
extern volatile __bit                   G1CS0               __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 G1CS0_bit           _BIT_ACCESS(COG1CON0,3)
// COG1CON0<G1CS1>
extern volatile __bit                   G1CS1               __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 G1CS1_bit           _BIT_ACCESS(COG1CON0,4)
// COG1DBF<G1DBF0>
extern volatile __bit                   G1DBF0              __at(0x3490);	// @ (0x692 * 8 + 0)
#define                                 G1DBF0_bit          _BIT_ACCESS(COG1DBF,0)
// COG1DBF<G1DBF1>
extern volatile __bit                   G1DBF1              __at(0x3491);	// @ (0x692 * 8 + 1)
#define                                 G1DBF1_bit          _BIT_ACCESS(COG1DBF,1)
// COG1DBF<G1DBF2>
extern volatile __bit                   G1DBF2              __at(0x3492);	// @ (0x692 * 8 + 2)
#define                                 G1DBF2_bit          _BIT_ACCESS(COG1DBF,2)
// COG1DBF<G1DBF3>
extern volatile __bit                   G1DBF3              __at(0x3493);	// @ (0x692 * 8 + 3)
#define                                 G1DBF3_bit          _BIT_ACCESS(COG1DBF,3)
// COG1DBF<G1DBF4>
extern volatile __bit                   G1DBF4              __at(0x3494);	// @ (0x692 * 8 + 4)
#define                                 G1DBF4_bit          _BIT_ACCESS(COG1DBF,4)
// COG1DBF<G1DBF5>
extern volatile __bit                   G1DBF5              __at(0x3495);	// @ (0x692 * 8 + 5)
#define                                 G1DBF5_bit          _BIT_ACCESS(COG1DBF,5)
// COG1DBR<G1DBR0>
extern volatile __bit                   G1DBR0              __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 G1DBR0_bit          _BIT_ACCESS(COG1DBR,0)
// COG1DBR<G1DBR1>
extern volatile __bit                   G1DBR1              __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 G1DBR1_bit          _BIT_ACCESS(COG1DBR,1)
// COG1DBR<G1DBR2>
extern volatile __bit                   G1DBR2              __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 G1DBR2_bit          _BIT_ACCESS(COG1DBR,2)
// COG1DBR<G1DBR3>
extern volatile __bit                   G1DBR3              __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 G1DBR3_bit          _BIT_ACCESS(COG1DBR,3)
// COG1DBR<G1DBR4>
extern volatile __bit                   G1DBR4              __at(0x348C);	// @ (0x691 * 8 + 4)
#define                                 G1DBR4_bit          _BIT_ACCESS(COG1DBR,4)
// COG1DBR<G1DBR5>
extern volatile __bit                   G1DBR5              __at(0x348D);	// @ (0x691 * 8 + 5)
#define                                 G1DBR5_bit          _BIT_ACCESS(COG1DBR,5)
// COG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x349F);	// @ (0x693 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(COG1CON0,7)
// COG1CON1<G1FDBS>
extern volatile __bit                   G1FDBS              __at(0x34A6);	// @ (0x694 * 8 + 6)
#define                                 G1FDBS_bit          _BIT_ACCESS(COG1CON1,6)
// COG1FIS0<G1FIS0>
extern volatile __bit                   G1FIS0              __at(0x34C8);	// @ (0x699 * 8 + 0)
#define                                 G1FIS0_bit          _BIT_ACCESS(COG1FIS0,0)
// COG1FIS0<G1FIS1>
extern volatile __bit                   G1FIS1              __at(0x34C9);	// @ (0x699 * 8 + 1)
#define                                 G1FIS1_bit          _BIT_ACCESS(COG1FIS0,1)
// COG1FIS1<G1FIS10>
extern volatile __bit                   G1FIS10             __at(0x34D2);	// @ (0x69A * 8 + 2)
#define                                 G1FIS10_bit         _BIT_ACCESS(COG1FIS1,2)
// COG1FIS1<G1FIS11>
extern volatile __bit                   G1FIS11             __at(0x34D3);	// @ (0x69A * 8 + 3)
#define                                 G1FIS11_bit         _BIT_ACCESS(COG1FIS1,3)
// COG1FIS1<G1FIS12>
extern volatile __bit                   G1FIS12             __at(0x34D4);	// @ (0x69A * 8 + 4)
#define                                 G1FIS12_bit         _BIT_ACCESS(COG1FIS1,4)
// COG1FIS1<G1FIS13>
extern volatile __bit                   G1FIS13             __at(0x34D5);	// @ (0x69A * 8 + 5)
#define                                 G1FIS13_bit         _BIT_ACCESS(COG1FIS1,5)
// COG1FIS1<G1FIS14>
extern volatile __bit                   G1FIS14             __at(0x34D6);	// @ (0x69A * 8 + 6)
#define                                 G1FIS14_bit         _BIT_ACCESS(COG1FIS1,6)
// COG1FIS1<G1FIS15>
extern volatile __bit                   G1FIS15             __at(0x34D7);	// @ (0x69A * 8 + 7)
#define                                 G1FIS15_bit         _BIT_ACCESS(COG1FIS1,7)
// COG1FIS0<G1FIS2>
extern volatile __bit                   G1FIS2              __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 G1FIS2_bit          _BIT_ACCESS(COG1FIS0,2)
// COG1FIS0<G1FIS3>
extern volatile __bit                   G1FIS3              __at(0x34CB);	// @ (0x699 * 8 + 3)
#define                                 G1FIS3_bit          _BIT_ACCESS(COG1FIS0,3)
// COG1FIS0<G1FIS4>
extern volatile __bit                   G1FIS4              __at(0x34CC);	// @ (0x699 * 8 + 4)
#define                                 G1FIS4_bit          _BIT_ACCESS(COG1FIS0,4)
// COG1FIS0<G1FIS5>
extern volatile __bit                   G1FIS5              __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 G1FIS5_bit          _BIT_ACCESS(COG1FIS0,5)
// COG1FIS0<G1FIS6>
extern volatile __bit                   G1FIS6              __at(0x34CE);	// @ (0x699 * 8 + 6)
#define                                 G1FIS6_bit          _BIT_ACCESS(COG1FIS0,6)
// COG1FIS0<G1FIS7>
extern volatile __bit                   G1FIS7              __at(0x34CF);	// @ (0x699 * 8 + 7)
#define                                 G1FIS7_bit          _BIT_ACCESS(COG1FIS0,7)
// COG1FIS1<G1FIS8>
extern volatile __bit                   G1FIS8              __at(0x34D0);	// @ (0x69A * 8 + 0)
#define                                 G1FIS8_bit          _BIT_ACCESS(COG1FIS1,0)
// COG1FIS1<G1FIS9>
extern volatile __bit                   G1FIS9              __at(0x34D1);	// @ (0x69A * 8 + 1)
#define                                 G1FIS9_bit          _BIT_ACCESS(COG1FIS1,1)
// COG1FSIM0<G1FSIM0>
extern volatile __bit                   G1FSIM0             __at(0x34D8);	// @ (0x69B * 8 + 0)
#define                                 G1FSIM0_bit         _BIT_ACCESS(COG1FSIM0,0)
// COG1FSIM0<G1FSIM1>
extern volatile __bit                   G1FSIM1             __at(0x34D9);	// @ (0x69B * 8 + 1)
#define                                 G1FSIM1_bit         _BIT_ACCESS(COG1FSIM0,1)
// COG1FSIM1<G1FSIM10>
extern volatile __bit                   G1FSIM10            __at(0x34E2);	// @ (0x69C * 8 + 2)
#define                                 G1FSIM10_bit        _BIT_ACCESS(COG1FSIM1,2)
// COG1FSIM1<G1FSIM11>
extern volatile __bit                   G1FSIM11            __at(0x34E3);	// @ (0x69C * 8 + 3)
#define                                 G1FSIM11_bit        _BIT_ACCESS(COG1FSIM1,3)
// COG1FSIM1<G1FSIM12>
extern volatile __bit                   G1FSIM12            __at(0x34E4);	// @ (0x69C * 8 + 4)
#define                                 G1FSIM12_bit        _BIT_ACCESS(COG1FSIM1,4)
// COG1FSIM1<G1FSIM13>
extern volatile __bit                   G1FSIM13            __at(0x34E5);	// @ (0x69C * 8 + 5)
#define                                 G1FSIM13_bit        _BIT_ACCESS(COG1FSIM1,5)
// COG1FSIM1<G1FSIM14>
extern volatile __bit                   G1FSIM14            __at(0x34E6);	// @ (0x69C * 8 + 6)
#define                                 G1FSIM14_bit        _BIT_ACCESS(COG1FSIM1,6)
// COG1FSIM1<G1FSIM15>
extern volatile __bit                   G1FSIM15            __at(0x34E7);	// @ (0x69C * 8 + 7)
#define                                 G1FSIM15_bit        _BIT_ACCESS(COG1FSIM1,7)
